In [1]:
import pandas as pd
import numpy as np

In [2]:
ls

'Data Exploration.html'              test_predictdata.csv
'Data Exploration.ipynb'             train_predictdata.csv
 README.md                          'Transactional data.xlsx'
 sample_submission_predictdata.csv   Transactional.ipynb

In [3]:
df = pd.read_excel('Transactional data.xlsx',sheet_name="input",skiprows=1)

In [4]:
df.columns

Index(['Customer ID', 'Time stamp', 'Product Name', 'Unnamed: 3'], dtype='object')

# Removing column

In [ ]:
# Removing column
# axis=0 row axis
# axis=1 column axis
# inplace=True to effect change
df.drop('Unnamed: 3', axis=1, inplace=True)

In [5]:
# Removing columns
list_drop = ['Unnamed: 3']
df.drop(list_drop, axis=1, inplace=True)

In [6]:
df.head()

   Customer ID          Time stamp            Product Name
0          147 2015-04-13 16:01:07         Cricket Bat MRF
1          151 2015-04-15 11:00:55  Badminton Racket Yonex
2          142 2015-03-11 14:53:04      Feather Ball Yonex
3          132 2015-06-11 13:20:07    Tennis Racket Wilson
4          186 2015-04-20 17:24:56                 Helmet

In [8]:
df1 = df.copy()

In [9]:
df2 = df.copy()

In [17]:
df3 = df.copy()

# Removing Row

In [18]:
# Removing rows 0 and 1
# axis=0 is the default, so technically, you can leave this out
rows = [0,1]
df3.drop(rows, axis=0,inplace=True)

In [20]:
df3.head()

   Customer ID          Time stamp            Product Name
2          142 2015-03-11 14:53:04      Feather Ball Yonex
3          132 2015-06-11 13:20:07    Tennis Racket Wilson
4          186 2015-04-20 17:24:56                 Helmet
5          123 2015-06-28 15:14:39         Cricket Bat MRF
6          152 2015-05-09 13:19:43  Badminton Racket Yonex

# Renaming columns in a pandas DataFrame

# Method 1: Renaming a single column

In [10]:
# inplace=True to affect DataFrame
df1.rename(columns={'Customer ID':'Customer_ID'},inplace =True)

In [11]:
df1.head()

   Customer_ID          Time stamp            Product Name
0          147 2015-04-13 16:01:07         Cricket Bat MRF
1          151 2015-04-15 11:00:55  Badminton Racket Yonex
2          142 2015-03-11 14:53:04      Feather Ball Yonex
3          132 2015-06-11 13:20:07    Tennis Racket Wilson
4          186 2015-04-20 17:24:56                 Helmet

In [12]:
# Method 2: Renaming multiple columns
df1_cols = ['Customer_ID','Time_stamp', 'Product_Name']

In [13]:
df1.columns =df1_cols

In [ ]:
df1.iloc[:,1:].columns = df1_cols

In [14]:
df1.head()

   Customer_ID          Time_stamp            Product_Name
0          147 2015-04-13 16:01:07         Cricket Bat MRF
1          151 2015-04-15 11:00:55  Badminton Racket Yonex
2          142 2015-03-11 14:53:04      Feather Ball Yonex
3          132 2015-06-11 13:20:07    Tennis Racket Wilson
4          186 2015-04-20 17:24:56                 Helmet

In [ ]:
# Method 3: Change columns while reading
# df2 = pd.read_excel('Transactional data.xlsx', names = df1_cols, inplace =True, )

In [15]:
# Method 4: Replacing spaces with underscores for all columns
# If you have a 100 columns, some had spaces in them and you want to replace all the spaces with underscores
df2.columns = df2.columns.str.replace(' ','_')

In [16]:
df2.head()

   Customer_ID          Time_stamp            Product_Name
0          147 2015-04-13 16:01:07         Cricket Bat MRF
1          151 2015-04-15 11:00:55  Badminton Racket Yonex
2          142 2015-03-11 14:53:04      Feather Ball Yonex
3          132 2015-06-11 13:20:07    Tennis Racket Wilson
4          186 2015-04-20 17:24:56                 Helmet

In [29]:
df2['Product_Name'].count_values

AttributeError: 'Series' object has no attribute 'count_values'

In [22]:
df2.head(20)

    Customer_ID          Time_stamp            Product_Name
0           147 2015-04-13 16:01:07         Cricket Bat MRF
1           151 2015-04-15 11:00:55  Badminton Racket Yonex
2           142 2015-03-11 14:53:04      Feather Ball Yonex
3           132 2015-06-11 13:20:07    Tennis Racket Wilson
4           186 2015-04-20 17:24:56                 Helmet
5           123 2015-06-28 15:14:39         Cricket Bat MRF
6           152 2015-05-09 13:19:43  Badminton Racket Yonex
7           193 2015-04-12 12:31:01      Feather Ball Yonex
8           196 2015-04-13 16:01:07         Cricket Bat MRF
9           161 2015-04-15 11:00:55  Badminton Racket Yonex
10          130 2015-03-11 14:53:04      Feather Ball Yonex
11          106 2015-06-11 13:20:07    Tennis Racket Wilson
12          163 2015-04-20 17:24:56                 Helmet
13          200 2015-06-28 15:14:39         Cricket Bat MRF
14          175 2015-05-09 13:19:43  Badminton Racket Yonex
15          162 2015-04-12 12:31:01      Feather Ball Yonex
16          107 2015-04-13 16:01:07         Cricket Bat MRF
17          121 2015-04-15 11:00:55  Badminton Racket Yonex
18          171 2015-03-11 14:53:04      Feather Ball Yonex
19          192 2015-06-11 13:20:07    Tennis Racket Wilson